OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f071cx6.h
/*!< I2C_CCR */
#define I2C_CCR_CCR_Pos                           (0U)
#define I2C_CCR_CCR_Msk                           (0xFFFUL << I2C_CCR_CCR_Pos)                      /*!< 0x00000FFF */
#define I2C_CCR_CCR                               I2C_CCR_CCR_Msk                                   /*!< CCR[11:0] bits (desc CCR) */
#define I2C_CCR_DUTY_Pos                          (14U)
#define I2C_CCR_DUTY_Msk                          (0x1UL << I2C_CCR_DUTY_Pos)                       /*!< 0x00004000 */
#define I2C_CCR_DUTY                              I2C_CCR_DUTY_Msk                                  /*!< desc DUTY */
#define I2C_CCR_FS_Pos                            (15U)
#define I2C_CCR_FS_Msk                            (0x1UL << I2C_CCR_FS_Pos)                         /*!< 0x00008000 */
#define I2C_CCR_FS                                I2C_CCR_FS_Msk                                    /*!< desc FS */

/*!< I2C_TRISE */
#define I2C_TRISE_TRISE_Pos                       (0U)
#define I2C_TRISE_TRISE_Msk                       (0x3FUL << I2C_TRISE_TRISE_Pos)                   /*!< 0x0000003F */
#define I2C_TRISE_TRISE                           I2C_TRISE_TRISE_Msk                               /*!< TRISE[5:0] bits (desc TRISE) */

/****************************************************************************/
/*                                                                          */
/*                        Independent WATCHDOG (IWDG)                       */
/*                                                                          */
/****************************************************************************/
/*******************  Bit definition for IWDG_KR register  ******************/
#define IWDG_KR_KEY_Pos      (0U)
#define IWDG_KR_KEY_Msk      (0xFFFFUL << IWDG_KR_KEY_Pos)                     /*!< 0x0000FFFF */
#define IWDG_KR_KEY          IWDG_KR_KEY_Msk                                   /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ******************/
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *****************/
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ******************/
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos      (1U)
#define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        /*!< 0x00000002 */
#define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */

/****************************************************************************/
/*                                                                          */
/*                          OPA calculation unit (OPA)                      */
/*                                                                          */
/****************************************************************************/
/*******************  Bit definition for OPA_CR0 register  ******************/
#define OPA_CR0_OP1OEN1_Pos              (1U)
#define OPA_CR0_OP1OEN1_Msk              (0x1UL << OPA_CR0_OP1OEN1_Pos)
#define OPA_CR0_OP1OEN1                  OPA_CR0_OP1OEN1_Msk
#define OPA_CR0_OP2OEN1_Pos              (6U)
#define OPA_CR0_OP2OEN1_Msk              (0x1UL << OPA_CR0_OP2OEN1_Pos)
#define OPA_CR0_OP2OEN1                  OPA_CR0_OP2OEN1_Msk
#define OPA_CR0_OP3OEN1_Pos              (11U)
#define OPA_CR0_OP3OEN1_Msk              (0x1UL << OPA_CR0_OP3OEN1_Pos)
#define OPA_CR0_OP3OEN1                  OPA_CR0_OP3OEN1_Msk

/*******************  Bit definition for OPA_CR1 register  ******************/
#define OPA_CR1_EN1_Pos                (5U)
#define OPA_CR1_EN1_Msk                (0x1UL << OPA_CR1_EN1_Pos)
#define OPA_CR1_EN1                    OPA_CR1_EN1_Msk
#define OPA_CR1_EN2_Pos                (6U)
#define OPA_CR1_EN2_Msk                (0x1UL << OPA_CR1_EN2_Pos)
#define OPA_CR1_EN2                    OPA_CR1_EN2_Msk
#define OPA_CR1_EN3_Pos                (7U)
#define OPA_CR1_EN3_Msk                (0x1UL << OPA_CR1_EN3_Pos)
#define OPA_CR1_EN3                    OPA_CR1_EN3_Msk

/*******************  Bit definition for OPA_CR1 register  ******************/
#define OPA_CR2_OPA_TRIM1_Pos                (0U)
#define OPA_CR2_OPA_TRIM1_Msk                (0xFUL << OPA_CR2_OPA_TRIM1_Pos)
#define OPA_CR2_OPA_TRIM1                    OPA_CR2_OPA_TRIM1_Msk
#define OPA_CR2_OPA_TRIM2_Pos                (4U)
#define OPA_CR2_OPA_TRIM2_Msk                (0xFUL << OPA_CR2_OPA_TRIM2_Pos)
#define OPA_CR2_OPA_TRIM2                    OPA_CR2_OPA_TRIM2_Msk
#define OPA_CR2_OPA_TRIM3_Pos                (8U)
#define OPA_CR2_OPA_TRIM3_Msk                (0xFUL << OPA_CR2_OPA_TRIM3_Pos)
#define OPA_CR2_OPA_TRIM3                    OPA_CR2_OPA_TRIM3_Msk

/****************************************************************************/
/*                                                                          */
/*                          Power Control (PWR)                             */
/*                                                                          */
/****************************************************************************/
#define PWR_PVD_SUPPORT                       /*!< PWR feature available only on specific devices: Power Voltage Detection feature */
#define PWR_BOR_SUPPORT                       /*!< PWR feature available only on specific devices: Brown-Out Reset feature         */
#define PWR_SHDW_SUPPORT                      /*!< PWR feature available only on specific devices: Shutdown mode */

/*********************  Bits Define For Peripheral PWR  *********************/
/*!< PWR_CR1 */
#define PWR_CR1_BIAS_CR_Pos                (0U)
#define PWR_CR1_BIAS_CR_Msk                (0xFUL << PWR_CR1_BIAS_CR_Pos)                     /*!< 0x000000E0 */
#define PWR_CR1_BIAS_CR                    PWR_CR1_BIAS_CR_Msk                                /*!< PLS[7:5] bits (desc PLS) */
#define PWR_CR1_BIAS_CR_0                  (0x1UL << PWR_CR1_BIAS_CR_Pos)                     /*!< 0x00000020 */
#define PWR_CR1_BIAS_CR_1                  (0x2UL << PWR_CR1_BIAS_CR_Pos)                     /*!< 0x00000040 */
#define PWR_CR1_BIAS_CR_2                  (0x4UL << PWR_CR1_BIAS_CR_Pos)
#define PWR_CR1_BIAS_CR_SEL_Pos            (4U)
#define PWR_CR1_BIAS_CR_SEL_Msk            (0x1UL << PWR_CR1_BIAS_CR_SEL_Pos)                 /*!< 0x000000E0 */
#define PWR_CR1_BIAS_CR_SEL                PWR_CR1_BIAS_CR_SEL_Msk
#define PWR_CR1_DBP_Pos                    (8U)
#define PWR_CR1_DBP_Msk                    (0x1UL << PWR_CR1_DBP_Pos)                         /*!< 0x00000100 */
#define PWR_CR1_DBP                        PWR_CR1_DBP_Msk
#define PWR_CR1_VOS_Pos                    (9U)
#define PWR_CR1_VOS_Msk                    (0x3UL << PWR_CR1_VOS_Pos)                         /*!< 0x00006000 */
#define PWR_CR1_VOS                        PWR_CR1_VOS_Msk                                    /*!< VOS[14:13] bits (desc VOS) */
#define PWR_CR1_VOS_0                      (0x1UL << PWR_CR1_VOS_Pos)                         /*!< 0x00002000 */
#define PWR_CR1_VOS_1                      (0x2UL << PWR_CR1_VOS_Pos)
#define PWR_CR1_FLS_SLPTIME_Pos            (12U)
#define PWR_CR1_FLS_SLPTIME_Msk            (0x3UL << PWR_CR1_FLS_SLPTIME_Pos)                 /*!< 0x00006000 */
#define PWR_CR1_FLS_SLPTIME                PWR_CR1_FLS_SLPTIME_Msk                            /*!< VOS[14:13] bits (desc VOS) */
#define PWR_CR1_FLS_SLPTIME_0              (0x1UL << PWR_CR1_FLS_SLPTIME_Pos)                 /*!< 0x00002000 */
#define PWR_CR1_FLS_SLPTIME_1              (0x2UL << PWR_CR1_FLS_SLPTIME_Pos)
#define PWR_CR1_LPR_Pos                    (14U)
#define PWR_CR1_LPR_Msk                    (0x1UL << PWR_CR1_LPR_Pos)                         /*!< 0x00000100 */
#define PWR_CR1_LPR                        PWR_CR1_LPR_Msk
#define PWR_CR1_HSION_CTRL_Pos             (19U)
#define PWR_CR1_HSION_CTRL_Msk             (0x1UL << PWR_CR1_HSION_CTRL_Pos)                  /*!< 0x00000100 */
#define PWR_CR1_HSION_CTRL                 PWR_CR1_HSION_CTRL_Msk

/*!< PWR_CR2 */
#define PWR_CR2_PVDE_Pos                   (0U)
#define PWR_CR2_PVDE_Msk                   (0x1UL << PWR_CR2_PVDE_Pos)                        /*!< 0x00000100 */
#define PWR_CR2_PVDE                       PWR_CR2_PVDE_Msk
#define PWR_CR2_SRCSEL_Pos                 (2U)
#define PWR_CR2_SRCSEL_Msk                 (0x1UL << PWR_CR2_SRCSEL_Pos)                      /*!< 0x00000100 */
#define PWR_CR2_SRCSEL                     PWR_CR2_SRCSEL_Msk
#define PWR_CR2_PVDT_Pos                   (4U)
#define PWR_CR2_PVDT_Msk                   (0x7UL << PWR_CR2_PVDT_Pos)                        /*!< 0x000000E0 */
#define PWR_CR2_PVDT                       PWR_CR2_PVDT_Msk                                   /*!< PLS[7:5] bits (desc PLS) */
#define PWR_CR2_PVDT_0                     (0x1UL << PWR_CR2_PVDT_Pos)                        /*!< 0x00000020 */
#define PWR_CR2_PVDT_1                     (0x2UL << PWR_CR2_PVDT_Pos)                        /*!< 0x00000040 */
#define PWR_CR2_PVDT_2                     (0x4UL << PWR_CR2_PVDT_Pos)
#define PWR_CR2_FLTEN_Pos                  (8U)
#define PWR_CR2_FLTEN_Msk                  (0x1UL << PWR_CR2_FLTEN_Pos)                       /*!< 0x000000E0 */
#define PWR_CR2_FLTEN                      PWR_CR2_FLTEN_Msk
#define PWR_CR2_FLT_TIME_Pos               (9U)
#define PWR_CR2_FLT_TIME_Msk               (0x7UL << PWR_CR2_FLT_TIME_Pos)                    /*!< 0x000000E0 */
#define PWR_CR2_FLT_TIME                   PWR_CR2_FLT_TIME_Msk                               /*!< PLS[7:5] bits (desc PLS) */
#define PWR_CR2_FLT_TIME_0                 (0x1UL << PWR_CR2_FLT_TIME_Pos)                    /*!< 0x00000020 */
#define PWR_CR2_FLT_TIME_1                 (0x2UL << PWR_CR2_FLT_TIME_Pos)                    /*!< 0x00000040 */
#define PWR_CR2_FLT_TIME_2                 (0x4UL << PWR_CR2_FLT_TIME_Pos)

